app/views/product/index.html.erb

SELECT  1 AS one FROM "purchases" WHERE "purchases"."product_id" = ? LIMIT 1  [["product_id", 1]]
---
<% @products.each do |p| %>
	<% if !Purchase.exists?(product_id: p.id) %>

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
		<td><%= p.name %></td>
		<td><%= User.find(p.user_id).full_name %></td>