app/views/product/show.html.erb

<% @my_products.each do |p| %>
	<% if !Purchase.exists?(product_id: p.id) or !Sale.exists?(product_id: p.id) %>
---
SELECT  1 AS one FROM "purchases" WHERE "purchases"."product_id" = ? LIMIT 1  [["product_id", 4]]
SELECT  1 AS one FROM "sales" WHERE "sales"."product_id" = ? LIMIT 1  [["product_id", 2]]

	<tr>
		<td><%= Product.find(s.product_id).name %></td>
		<td><%= s.created_at %></td>
		<td><%= User.find(s.buyer_id).full_name %></td>
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 3]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]