app/controllers/product_controller.rb

  def index
    @user = User.find_by(id: session[:logged_in_as])
    @products = Product.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "products".* FROM "products"

  def show
    @user = User.find_by(id: session[:logged_in_as])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]

  def create
    product = Product.new(params.require(:product).permit(:user_id, :name, :amount))
    if !product.valid?
      return render 'show'
    end
    product.save
---
INSERT INTO "products" ("user_id", "name", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["name", "Aqua Nike"], ["amount", 300.0], ["created_at", "2017-03-01 19:13:20.693501"], ["updated_at", "2017-03-01 19:13:20.693501"]]

  def buy
    Purchase.create(user_id:session[:logged_in_as], product_id:params[:id], seller_id:Product.find(params[:id]).user_id)
    Sale.create(user_id:Product.find(params[:id]).user_id, product_id:params[:id], buyer_id:session[:logged_in_as])
---
INSERT INTO "purchases" ("user_id", "product_id", "seller_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["product_id", 3], ["seller_id", 3], ["created_at", "2017-03-01 20:42:45.676981"], ["updated_at", "2017-03-01 20:42:45.676981"]]
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 3]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "sales" ("user_id", "product_id", "buyer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 3], ["product_id", 3], ["buyer_id", 1], ["created_at", "2017-03-01 20:54:55.150752"], ["updated_at", "2017-03-01 20:54:55.150752"]]

  def destroy
    Product.find(params[:id]).delete
---
DELETE FROM "products" WHERE "products"."id" = ?  [["id", 3]]
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 3]]