app/controllers/users_controller.rb

  def create
  	user = User.new(user_params)
  	if !user.valid?
  		@user = user
  		return render 'new'
  	end
  	user.save
---
INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)